package days09_Review;

public class Home_Review02 {

	public static void main(String[] args) {
		//2. 1차원, 2차원, 3차원 배열 개념 설명 
		/*
		배열 : 동일한 자료형을 메모리상에 연속적으로 놓기에 한 것
		
		1차원 배열 : 자료형[] 배열명 = {,1,2,3,4,6,7};
						자료형[] 배열명 = new 자료형[a]
		
		2차원 배열 : 자료형[][] 배열명 = {													자료형[][] 배열명 = new 자료형[a][b]
														{,1,2,3,4},  		[행][열]
														{,5,6,7,8}
				
													};
		3차원 배열 : 자료형[][][] 배열명 = {												자료형[][][] 배열명 = new 자료형[a][b][c]
															{1,2,3,4},
															{4,5,6,7},
															{7,8,9,10}
														},
														{
															{1,2,3,4},
															{4,5,6,7},
															{7,8,9,10}
														};
		
		
		*/

	}

}
