package review01;

public class Review04 {

	public static void main(String[] args) {
		// 자동 타입변환과 강제 타입변환에 대해서 설명하세요. 
		//자동 타입 변환
		// 1. 더 큰 자료 형  = 작은 자료 형
		// 2. 더 큰 자료 형 + 작은 자료 형
		
		//강제 타입 변환
		//(변환하고자하는 타입) cast 연산자
		
		
		//논리연산자의 종류와 우선 순위에 대해서 설명하세요.
		// &&(AND), ||(OR), ^(XOR) !(NOT)
		// 우선순위 ! > ^ > && > ||
		// ! - 피연산자의 논리값 변경
		// ^ - 피연산자 중 1개만 참일 때 참
		// && - 피연산자가 모두 참일 때, 참
		// || - 피연산자 중 하나라도 참일 때, 참
		
		
		//삼항(조건) 연산자에 대해서 설명하세요. 
				// 항이 3개이며  형태는   항1 ? 항2 : 항3
				//항1이 참일 경우, 항2
				//항1이 거짓일 경우, 항3
		
		//두 문자열을 비교하는 방법에 대해서 설명하세요.
		// 문자열끼리 비교할 때는 .equals()   !.equals()를 사용한다.
		
		
	}

}
